circular-cylinder-3-30/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type		freestreamPressure;
	freestreamValue uniform 0;	
    }
    outlet
    {
	type		freestreamPressure;
	freestreamValue uniform 0;
    }
    top
    {
	type		symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }

    cylinder
    {
        type            zeroGradient;
    }

    frontandback
    {
        type            empty;
    }
}

// ************************************************************************* //

